{"42.11-Buddhist-Practice":{"title":"42.11 Buddhist Practice","links":["Sati-is-not-samadhi-or-concentration","The-sound-of-silence-indicates-that-you-are-fully-open","as-long-as-i-have-dhamma,-i-am-ok","Contentment-about-living-situation","goggins-khanti-endurance","Video-from-when-I-was-a-monk","suttas","Dispassion","Favorite-Dhamma-Talks","EN371","areas"],"tags":["category","index"],"content":"Buddhist Practice\nSati\n\nSati is not samadhi or concentration\nThe sound of silence indicates that you are fully open\n\nLiving situation\n\nas long as i have dhamma, i am ok\nContentment about living situation\n\nMisc\n\ngoggins-khanti-endurance\nVideo from when I was a monk\nsuttas\nDispassion\nFavorite Dhamma Talks\n\nXu Yun:\nEN371\nareas"},"Projects-in-JD-System-1":{"title":"Projects in JD System 1","links":[],"tags":[],"content":"Projects in Johnny Decimal System\nI need a way of assigning ID’s to projects.\nThis can be projects for clients, homelab projects, non-tech related projects.\nCode repos will be stored with the projects, alongside all other possible artifacts.\nI don’t need a single place for all projects.\nProjects can just be all over the place.\nWhat’s the point?\nI need to be able to find them and to assign ID’s to them that I can reuse across several systems.\nThat’s all.\nFor the first time I think I have finally found a use for tags in my notetaking system. If I need to pull out all projects for some reason, I will use tags."},"Sati-is-not-samadhi-or-concentration":{"title":"Sati is not samadhi or concentration","links":["45.41.03---Monastery-03---10-2020-to-01-21","The-sound-of-silence-indicates-that-you-are-fully-open"],"tags":[],"content":"Sati is not samadhi or concentration\nI discovered a fundamental miscondeption during my first solo retreat. I have always confused sati with samadhi, peace, or a calm mind empty of objects. The experience of establishing sati (mindfulness) always tends to involve tension, a certain tension around the forehead. but what I think I’m doing when in that moment is actually pacifying or pushing away the mental objects, thoughts, proliferation, instead of watching, observing, paying deliberate attention.\nIt seems there is quite a difference there. No wonder I struggle with “maintaining sati”. Who can maintain constant peace of mind throughout theday? Only the noble ones.\nSati is not concentration, vitakka.\nFrom 45.41.03 - Monastery 03 - 10-2020 to 01-21, page 91.\nThe sound of silence indicates that you are fully open"},"index":{"title":"Home","links":["42.11-Buddhist-Practice"],"tags":["index"],"content":"Welcome. I’ve been keeping a Zettelkasten for about 3 years now, and I’ve accumulated nearly 2500 notes. And I enjoy reading other people’s Zettelkasten too, such as rwxrob’s. It shows me what they’re currently obsessed with or working on, and I like to follow their journeys in that way.\nPublishing my writing to the world started with my tech blog. I wrote about my journey into DevOps and what I was learning along the way, and found it to be an enjoyable practice.\nIf you are interesed in following me I suggest you add this website to your preferred RSS reader  so you get regular updates.\nIf you wish to get in touch with me, take a look at mischavandenburg.com\nTopics - Entry points for Exploration\n42.11 Buddhist Practice"},"publish-template":{"title":"publish template","links":[],"tags":[],"content":""}}