{"42.11-Buddhist-Practice":{"title":"42.11 Buddhist Practice","links":["Sati-is-not-samadhi-or-concentration","The-sound-of-silence-indicates-that-you-are-fully-open","as-long-as-i-have-dhamma,-i-am-ok","Contentment-about-living-situation","goggins-khanti-endurance","Video-from-when-I-was-a-monk","suttas","Dispassion","Favorite-Dhamma-Talks","EN371","areas"],"tags":["category","index"],"content":"Buddhist Practice\nSati\n\nSati is not samadhi or concentration\nThe sound of silence indicates that you are fully open\n\nLiving situation\n\nas long as i have dhamma, i am ok\nContentment about living situation\n\nMisc\n\ngoggins-khanti-endurance\nVideo from when I was a monk\nsuttas\nDispassion\nFavorite Dhamma Talks\n\nXu Yun:\nEN371\nareas"},"Adding-metrics-server-to-Azure-Local-AKS":{"title":"Adding metrics server to Azure Local AKS","links":[],"tags":[],"content":"Adding metrics server to Azure Local in AKS\nWhen running AKS on Azure Local, the metrics server is not included, k top node or the metrics in k9s do not work.\nAdd it by:\nkubectl apply -f github.com/kubernetes-sigs/metrics-server/releases/latest/download/components.yaml"},"I-built-my-own-publishing-solution-instead-of-Obsidian-Publish":{"title":"I built my own publishing solution instead of Obsidian Publish","links":[],"tags":[],"content":"I built my own publishing solution instead of Obsidian Publish\nInstead of relying on Obsidian publish, I wrote some Python code to parse my Zettelkasten for the “published: true” property.\nIt keeps track of files and hashes in a Postgres database, and when it finds a new file, it will push it to a webhook in make, which will publish it to X through Buffer.\nPretty neat setup, I’m now going to add a module so it will also publish it to my old blog.\nI haven’t been posting on my blog for ages, but I think that it will help if I can just easily publish from my Zettelkasten by simply adding some YAML frontmatter. It won’t matter if I’m in Obsidian or (neo)vim."},"Johnny-Decimal":{"title":"Johnny Decimal","links":["Zettelkasten","The-whole-JD-Workshop-is-just-one-ID","93.02---JD-Scope","34-Aims-for-Areas-and-Categories","First-attempt-at-an-index","Storing-Repos-in-Johnny-Decimal-system","An-ID-is-a-place-where-you-do-work","Johnny-uses-a-lot-of-subfolders-and-sub-ids-too","Projects-in-JD-System","Projects-in-JD-System-1"],"tags":["index"],"content":"Johnny Decimal\nZettelkasten\n\nThe whole JD Workshop is just one ID\n93.02 - JD Scope\n34 Aims for Areas and Categories\nFirst attempt at an index\nStoring Repos in Johnny Decimal system\nAn ID is a place where you do work\nJohnny uses a lot of subfolders and sub-ids too\nProjects in JD System\nProjects in JD System 1\n"},"Johnny-uses-a-lot-of-subfolders-and-sub-ids-too":{"title":"Johnny uses a lot of subfolders and sub-ids too","links":["Storing-Repos-in-Johnny-Decimal-system"],"tags":[],"content":"Johnny uses a lot of subfolders and sub-ids too\nI like the concept of creating ID’s like 31.12.001 for things.\nOne use case is repos Storing Repos in Johnny Decimal system for example."},"Knowing-Containers,-Databases--and--Code-is-Magic":{"title":"Knowing Containers, Databases & Code is Magic","links":["I-built-my-own-publishing-solution-instead-of-Obsidian-Publish"],"tags":[],"content":"Knowing Containers, Databases &amp; Code is Magic\nForget making money.\nIf you learn to write Python code, work with containers, and how to store data in databases, there are so many interesting things you can build to enhance your life.\nThese three elements are all that are needed to create comprehensive applications that you can use to track, store and manipulate massive amounts of data.\nWhether it is your own knowledge, health metrics, or data from sensors, the possibilities are endless.\nIt truly feels like magic every time I build something new to solve a little problem for myself.\nI built my own publishing solution instead of Obsidian Publish"},"Projects-in-JD-System-1":{"title":"Projects in JD System 1","links":["Storing-Repos-in-Johnny-Decimal-system"],"tags":[],"content":"Projects in Johnny Decimal System\nI need a way of assigning ID’s to projects.\nThis can be projects for clients, homelab projects, non-tech related projects.\nCode repos will be stored with the projects, alongside all other possible artifacts.\nI don’t need a single place for all projects.\nProjects can just be all over the place.\nWhat’s the point?\nI need to be able to find them and to assign ID’s to them that I can reuse across several systems.\nThat’s all.\nFor the first time I think I have finally found a use for tags in my notetaking system. If I need to pull out all projects for some reason, I will use tags.\nStoring Repos in Johnny Decimal system"},"Sati-is-not-samadhi-or-concentration":{"title":"Sati is not samadhi or concentration","links":["45.41.03---Monastery-03---10-2020-to-01-21","The-sound-of-silence-indicates-that-you-are-fully-open"],"tags":[],"content":"Sati is not samadhi or concentration\nI discovered a fundamental miscondeption during my first solo retreat. I have always confused sati with samadhi, peace, or a calm mind empty of objects. The experience of establishing sati (mindfulness) always tends to involve tension, a certain tension around the forehead. but what I think I’m doing when in that moment is actually pacifying or pushing away the mental objects, thoughts, proliferation, instead of watching, observing, paying deliberate attention.\nIt seems there is quite a difference there. No wonder I struggle with “maintaining sati”. Who can maintain constant peace of mind throughout theday? Only the noble ones.\nSati is not concentration, vitakka.\nFrom 45.41.03 - Monastery 03 - 10-2020 to 01-21, page 91.\nThe sound of silence indicates that you are fully open"},"Storing-Repos-in-Johnny-Decimal-system":{"title":"Storing Repos in Johnny Decimal system","links":[],"tags":[],"content":"Storing Repos in Johnny Decimal system\nThe repo should be assigned an ID from the index.\nIt does not need to be added to the directory name of the repo.\nforum.johnnydecimal.com/t/please-check-my-jd-setup/1500/5\nI think I will store repos together with projects, because projects can have so many utilities and associated to so many things."},"index":{"title":"Home","links":["42.11-Buddhist-Practice"],"tags":["index"],"content":"Welcome. I’ve been keeping a Zettelkasten for about 3 years now, and I’ve accumulated nearly 2500 notes. And I enjoy reading other people’s Zettelkasten too, such as rwxrob’s. It shows me what they’re currently obsessed with or working on, and I like to follow their journeys in that way.\nPublishing my writing to the world started with my tech blog. I wrote about my journey into DevOps and what I was learning along the way, and found it to be an enjoyable practice.\nIf you are interesed in following me I suggest you add this website to your preferred RSS reader  so you get regular updates.\nIf you wish to get in touch with me, take a look at mischavandenburg.com\nTopics - Entry points for Exploration\n42.11 Buddhist Practice"},"publish-template":{"title":"publish template","links":[],"tags":[],"content":""}}